app/controllers/registrations_controller.rb

 def create
   super # this calls Devise::RegistrationsController#create
   resource.roles << Role.find_by_role(params[:role][:tech] == "1" ? 'tech' : 'user')
   resource.save(:validate => false)
---
INSERT INTO `user_roles` (`role_id`, `user_id`) VALUES (2, 2)
INSERT INTO `users` (`active`, `bio`, `city`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `distance`, `email`, `encrypted_password`, `full_name`, `last_sign_in_at`, `last_sign_in_ip`, `lat`, `lon`, `rate`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `state`, `timezone`, `updated_at`, `username`, `zip`) VALUES (1, NULL, 'ac', '2013-01-07 05:03:05', NULL, NULL, 20, 'jheald@sproutlet.io', '$2a$10$0MDPO3nrjA4Jj7QLuGiCRuSZ1j/YtkrS0v/pjnMKfpk5lAVOiBEJu', 'joe heald', NULL, NULL, NULL, NULL, 32.0, NULL, NULL, NULL, 0, 'nj', 'Eastern Time (US & Canada)', '2013-01-07 05:03:05', 'joejoe', '08401')
SELECT `roles`.* FROM `roles` WHERE `roles`.`role` = 'user' LIMIT 1
UPDATE `users` SET `last_sign_in_at` = '2013-01-07 15:31:44', `current_sign_in_at` = '2013-01-07 15:31:44', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2013-01-07 15:31:44' WHERE `users`.`id` = 4