app/views/layouts/_topbar.html.erb

SELECT `appointments`.* FROM `appointments` WHERE (status = 'unconfirmed' and user_id = 2)
---
						<% if user_role == 'user' %>
							<% @alert = Appointment.find(:all, :conditions => "status = 'unconfirmed' and user_id = #{current_user.id}")%>